of/org/yjn2/yjn2_rib_upper/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          29;
        startFace       24732;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          30;
        startFace       24761;
    }
    inlet
    {
        type            patch;
        nFaces          17;
        startFace       24791;
    }
    outlet
    {
        type            patch;
        nFaces          17;
        startFace       24808;
    }
    deck
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          268;
        startFace       24825;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          30834;
        startFace       25093;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       55927;
    }
)

// ************************************************************************* //
